In [1]:
import pandas as pd
import numpy as np

In [2]:
obj=pd.Series(['blue','red','green'], index=[0,2,5])

In [3]:
obj

0     blue
2      red
5    green
dtype: object

In [4]:
obj2=obj.reindex(range(6),method='ffill')
obj2

0     blue
1     blue
2      red
3      red
4      red
5    green
dtype: object

In [5]:
obj2.drop(4)

0     blue
1     blue
2      red
3      red
5    green
dtype: object

In [6]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),index=['bleep','bloop','blop','blurp'],columns=['one','two','three','four'])
data

       one  two  three  four
bleep    0    1      2     3
bloop    4    5      6     7
blop     8    9     10    11
blurp   12   13     14    15

In [7]:
data=pd.DataFrame(np.arange(16).reshape(4,4),index=['ohio','colorado','utah','new york'],columns=['one','two','three','four'])
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [8]:
data['three']

ohio         2
colorado     6
utah        10
new york    14
Name: three, dtype: int64

In [9]:
data[data['three']>5]

          one  two  three  four
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [10]:
data>5

            one    two  three   four
ohio      False  False  False  False
colorado  False  False   True   True
utah       True   True   True   True
new york   True   True   True   True

In [11]:
data[data<5]=0

In [12]:
data

          one  two  three  four
ohio        0    0      0     0
colorado    0    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [14]:
data.loc['colorado',['three','four']]

three    6
four     7
Name: colorado, dtype: int64

In [15]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: utah, dtype: int64

In [16]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: utah, dtype: int64

In [18]:
data.iloc[[2,3],[1,3]]

          two  four
utah        9    11
new york   13    15

In [21]:
ser=pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [25]:
ser2=pd.Series(np.arange(3.),index=['a','b','c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [26]:
ser2[-1]

2.0

In [27]:
s1=pd.Series([1.2,3.4,-2.1,7.3],index=['a','c','d','e'])
s1

a    1.2
c    3.4
d   -2.1
e    7.3
dtype: float64

In [28]:
s2=pd.Series([-2.1,3.1,-1.7,2,4.5],index=['a','c','e','f','g'])
s2

a   -2.1
c    3.1
e   -1.7
f    2.0
g    4.5
dtype: float64

In [29]:
s1+s2

a   -0.9
c    6.5
d    NaN
e    5.6
f    NaN
g    NaN
dtype: float64

In [31]:
df1=pd.DataFrame(np.arange(9.).reshape(3,3),columns=list('bcd'),index=['ohio','texas','colorado'])
df1

            b    c    d
ohio      0.0  1.0  2.0
texas     3.0  4.0  5.0
colorado  6.0  7.0  8.0

In [32]:
df2=pd.DataFrame(np.arange(12.).reshape(4,3),columns=list('bde'),index=['utah','ohio','texas','oregon'])
df2

          b     d     e
utah    0.0   1.0   2.0
ohio    3.0   4.0   5.0
texas   6.0   7.0   8.0
oregon  9.0  10.0  11.0

In [33]:
df1+df2

            b   c     d   e
colorado  NaN NaN   NaN NaN
ohio      3.0 NaN   6.0 NaN
oregon    NaN NaN   NaN NaN
texas     9.0 NaN  12.0 NaN
utah      NaN NaN   NaN NaN

In [36]:
df=df1.add(df2,fill_value=0)
df

            b    c     d     e
colorado  6.0  7.0   8.0   NaN
ohio      3.0  1.0   6.0   5.0
oregon    9.0  NaN  10.0  11.0
texas     9.0  4.0  12.0   8.0
utah      0.0  NaN   1.0   2.0

In [39]:
df1.sort_index()

            b    c    d
colorado  6.0  7.0  8.0
ohio      0.0  1.0  2.0
texas     3.0  4.0  5.0

In [41]:
obj=pd.Series(np.arange(4.),index=['c','d','a','b'])
obj

c    0.0
d    1.0
a    2.0
b    3.0
dtype: float64

In [42]:
obj.sort_index()

a    2.0
b    3.0
c    0.0
d    1.0
dtype: float64

In [48]:
df

            b    c     d     e
colorado  6.0  7.0   8.0   NaN
ohio      3.0  1.0   6.0   5.0
oregon    9.0  NaN  10.0  11.0
texas     9.0  4.0  12.0   8.0
utah      0.0  NaN   1.0   2.0

In [49]:
df.sort_index(axis=1,ascending=False)

             e     d    c    b
colorado   NaN   8.0  7.0  6.0
ohio       5.0   6.0  1.0  3.0
oregon    11.0  10.0  NaN  9.0
texas      8.0  12.0  4.0  9.0
utah       2.0   1.0  NaN  0.0